package com.example.loren.minesample.util;

/**
 * _ooOoo_
 * o8888888o
 * 88" . "88
 * (| -_- |)
 * O\ = /O
 * ____/`---'\____
 * .   ' \\| |// `.
 * / \\||| : |||// \
 * / _||||| -:- |||||- \
 * | | \\\ - /// | |
 * | \_| ''\---/'' | |
 * \ .-\__ `-` ___/-. /
 * ___`. .' /--.--\ `. . __
 * ."" '< `.___\_<|>_/___.' >'"".
 * | | : `- \`.;`\ _ /`;.`/ - ` : | |
 * \ \ `-. \_ __\ /__ _/ .-` / /
 * ======`-.____`-.___\_____/___.-`____.-'======
 * `=---='
 * <p>
 * .............................................
 * 佛祖保佑             永无BUG
 * <p>
 * Copyright (c) 17-1-17 by loren
 */

public class Constant {
    public static String JSON = "{\n" +
            "\"data\":[\n" +
            "{\n" +
            "\"type\":\"1\",\n" +
            " \"id\":\"1\",\n" +
            "\"url\":\"http://awb.img.xmtbang.com/img/uploadnew/201602/25/02512de9a2874184873c56dadc6dbcbd.jpg\",\n" +
            " \"msg\":\"Can I help you ?\"\n" +
            "}\n" +
            "]\n" +
            "}";
    public static String WEATHER_JSON="{\n" +
            "  \"data\": {\n" +
            "    \"yesterday\": {\n" +
            "      \"date\": \"4日星期四\",\n" +
            "      \"high\": \"高温 1℃\",\n" +
            "      \"fx\": \"北风\",\n" +
            "      \"low\": \"低温 -3℃\",\n" +
            "      \"fl\": \"<![CDATA[3-4级]]>\",\n" +
            "      \"type\": \"多云\"\n" +
            "    },\n" +
            "    \"city\": \"青岛\",\n" +
            "    \"aqi\": \"56\",\n" +
            "    \"forecast\": [\n" +
            "      {\n" +
            "        \"date\": \"5日星期五\",\n" +
            "        \"high\": \"高温 2℃\",\n" +
            "        \"fengli\": \"<![CDATA[3-4级]]>\",\n" +
            "        \"low\": \"低温 -2℃\",\n" +
            "        \"fengxiang\": \"北风\",\n" +
            "        \"type\": \"晴\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"date\": \"6日星期六\",\n" +
            "        \"high\": \"高温 4℃\",\n" +
            "        \"fengli\": \"<![CDATA[3-4级]]>\",\n" +
            "        \"low\": \"低温 -1℃\",\n" +
            "        \"fengxiang\": \"东北风\",\n" +
            "        \"type\": \"多云\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"date\": \"7日星期天\",\n" +
            "        \"high\": \"高温 3℃\",\n" +
            "        \"fengli\": \"<![CDATA[3-4级]]>\",\n" +
            "        \"low\": \"低温 -1℃\",\n" +
            "        \"fengxiang\": \"北风\",\n" +
            "        \"type\": \"雨夹雪\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"date\": \"8日星期一\",\n" +
            "        \"high\": \"高温 2℃\",\n" +
            "        \"fengli\": \"<![CDATA[5-6级]]>\",\n" +
            "        \"low\": \"低温 -2℃\",\n" +
            "        \"fengxiang\": \"北风\",\n" +
            "        \"type\": \"多云\"\n" +
            "      },\n" +
            "      {\n" +
            "        \"date\": \"9日星期二\",\n" +
            "        \"high\": \"高温 3℃\",\n" +
            "        \"fengli\": \"<![CDATA[5-6级]]>\",\n" +
            "        \"low\": \"低温 -4℃\",\n" +
            "        \"fengxiang\": \"北风\",\n" +
            "        \"type\": \"晴\"\n" +
            "      }\n" +
            "    ],\n" +
            "    \"ganmao\": \"天气较凉，较易发生感冒，请适当增加衣服。体质较弱的朋友尤其应该注意防护。\",\n" +
            "    \"wendu\": \"-1\"\n" +
            "  },\n" +
            "  \"status\": 1000,\n" +
            "  \"desc\": \"OK\"";
}
